{
  "_name_or_path": "nghuyong/ernie-3.0-nano-zh",
  "architectures": [
    "ErnieForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 312,
  "initializer_range": 0.02,
  "intermediate_size": 1248,
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 2048,
  "model_type": "ernie",
  "num_attention_heads": 12,
  "num_hidden_layers": 4,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "task_type_vocab_size": 16,
  "torch_dtype": "float32",
  "transformers_version": "4.27.0",
  "type_vocab_size": 4,
  "use_cache": true,
  "use_task_id": true,
  "vocab_size": 40000
}
